app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'teacher@gmail.com'
 LIMIT 1
---
        public function dashboard()
    {
        $session = session();
        if (! $session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $role = $session->get('userRole');
        $userEmail = $session->get('userEmail');

        // Get user details from database
        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('email', $userEmail)->first();