app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'teacher@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $session = session();

        if ($session->get('isLoggedIn')) {
            return redirect()->to(base_url('dashboard'));
        }
         // Process form submission (POST)
           if ($this->request->getMethod() === 'POST') {
               $email = trim((string) $this->request->getPost('email'));
               $password = (string) $this->request->getPost('password');

               $userModel = new \App\Models\UserModel();
               $user = $userModel->where('email', $email)->first();

SELECT *
FROM `users`
WHERE `email` = 'teacher@gmail.com'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `courses`
---
        public function dashboard()
    {
        $session = session();
        if (! $session->get('isLoggedIn')) {
            return redirect()->to(base_url('login'));
        }

        $role = $session->get('userRole');
        $userEmail = $session->get('userEmail');

        // Get user details from database
        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('email', $userEmail)->first();

        $data = [
            'userRole' => $role,
            'userEmail' => $userEmail,
            'userName' => $user['name'] ?? 'User'
        ];

        if ($role === 'admin') {
            $courseModel = new \App\Models\CourseModel();

            $data['totalUsers'] = $userModel->countAllResults();
            $data['courseCount'] = $courseModel->countAllResults();