app/Controllers/Materials.php

    public function upload($course_id)
    {
        $session = session();
        $userRole = $session->get('userRole');
        $userId = $session->get('user_id');

        $materialModel = new MaterialModel();
        $courseModel = new CourseModel();

        $course = $courseModel->find($course_id);
---
SELECT *
FROM `courses`
WHERE `courses`.`course_id` = '45'