app/Controllers/Notifications.php

    public function mark_as_read($id = null)
    {
        $session = session();
        $userId = $session->get('user_id');

        if (!$userId || !$id) {
            return $this->response->setJSON(['success' => false]);
        }

        $notif = $this->notificationModel->find($id);
---
SELECT *
FROM `notifications`
WHERE `notifications`.`id` = '9'