app/Models/AnnouncementModel.php

SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
---
    public function getAllAnnouncements()
    {
        return $this->orderBy('created_at', 'DESC')->findAll();