app/Models/CourseModel.php

SELECT `c`.*, `u`.`name` as `teacher_name`
FROM `courses` `c`
LEFT JOIN `users` `u` ON `c`.`teacher_id` = `u`.`id`
WHERE `c`.`teacher_id` IS NOT NULL
AND `c`.`course_id` NOT IN (SELECT `course_id` FROM `enrollments` WHERE `user_id` = '22')
ORDER BY `c`.`created_at` DESC
---
    public function getAvailableCoursesForStudent($studentId)
    {
        $builder = $this->db->table('courses c');
        $builder->select('c.*, u.name as teacher_name');
        $builder->join('users u', 'c.teacher_id = u.id', 'left');
        $builder->where('c.teacher_id IS NOT NULL');
        $builder->whereNotIn('c.course_id', function($query) use ($studentId) {
            $query->select('course_id')
                  ->from('enrollments')
                  ->where('user_id', $studentId);
        });
        $builder->orderBy('c.created_at', 'DESC');

        return $builder->get()->getResultArray();

SELECT `c`.*, COUNT(e.enrollment_id) as total_students
FROM `courses` `c`
LEFT JOIN `enrollments` `e` ON `c`.`course_id` = `e`.`course_id` AND `e`.`status` IN ("enrolled", "active")
WHERE `c`.`teacher_id` = '21'
GROUP BY `c`.`course_id`
ORDER BY `c`.`created_at` DESC
---
    public function getCoursesByTeacher($teacherId)
    {
        $builder = $this->db->table('courses c');
        $builder->select('c.*, COUNT(e.enrollment_id) as total_students');
        $builder->join('enrollments e', 'c.course_id = e.course_id AND e.status IN ("enrolled", "active")', 'left');
        $builder->where('c.teacher_id', $teacherId);
        $builder->groupBy('c.course_id');
        $builder->orderBy('c.created_at', 'DESC');

        return $builder->get()->getResultArray();