app/Models/EnrollmentModel.php

    public function getUserEnrollments($user_id)
    {
        $builder = $this->db->table('enrollments e');
        $builder->select('e.*, c.course_code, c.course_name, c.description, c.units, u.name as teacher_name');
        $builder->join('courses c', 'e.course_id = c.course_id', 'left');
        $builder->join('users u', 'c.teacher_id = u.id', 'left');
        $builder->where('e.user_id', $user_id);
        $builder->orderBy('e.enrollment_date', 'DESC');

        return $builder->get()->getResultArray();
---
SELECT `e`.*, `c`.`course_code`, `c`.`course_name`, `c`.`description`, `c`.`units`, `u`.`name` as `teacher_name`
FROM `enrollments` `e`
LEFT JOIN `courses` `c` ON `e`.`course_id` = `c`.`course_id`
LEFT JOIN `users` `u` ON `c`.`teacher_id` = `u`.`id`
WHERE `e`.`user_id` = '22'
ORDER BY `e`.`enrollment_date` DESC

    public function getCourseEnrollmentCount($course_id)
    {
        return $this->where('course_id', $course_id)
                   ->where('status', 'enrolled')
                   ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `enrollments`
WHERE `course_id` = '53'
AND `status` = 'enrolled'