app/Models/NotificationModel.php

    public function getNotificationsForUser($userId)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit(10)
                    ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '21'
ORDER BY `created_at` DESC
 LIMIT 10

    public function markAsRead($id)
    {
        return $this->update($id, ['is_read' => 1]);
---
UPDATE `notifications` SET `is_read` = 1
WHERE `notifications`.`id` IN ('9')